app/controllers/authorizations_controller.rb

UPDATE "users" SET "atoken" = '33159656-FwcdkSnMzJJAG7saIEqKzaHQzEVNDIZWTDO1Ebc6I', "asecret" = 'ngHsilVekDpw7a7qRkT1VmvDfqE1xuQL2urv3MYZ1U', "updated_at" = '2009-09-04 22:06:56' WHERE "id" = 9
---
  def show
    tw_oauth = current_user.tw_oauth
    tw_oauth.authorize_from_request(session['rtoken'], session['rsecret'])

    session['rtoken'] = nil
    session['rsecret'] = nil

    current_user.update_attributes({
      :atoken => tw_oauth.access_token.token,
      :asecret => tw_oauth.access_token.secret,
    })