app/controllers/statuses_controller.rb

  def index
    params[:page] ||= 1
    unless current_user.tw_client.nil?
      #@tweets = current_user.tw_client.friends_timeline(:page => params[:page])
      @tweets = Status.tw_read(current_user.tw_client)
      puts "@tweets is:"
      pp @tweets
      puts "@tweets.length is: " + @tweets.length.to_s
---
SELECT * FROM "statuses"