app/controllers/statuses_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    params[:page] ||= 1
    unless current_user.tw_client.nil?
      #@tweets = current_user.tw_client.friends_timeline(:page => params[:page])
      user = User.find(9)