app/controllers/users_controller.rb

INSERT INTO "users" ("encrypted_password", "salt", "updated_at", "token", "username", "token_expires_at", "tw_auth", "fb_auth", "atoken", "asecret", "password", "email", "created_at", "email_confirmed") VALUES('0fcec374e87ceefe6883d982f35afaff652a3767', 'ab4bb67acc3791c56111ef5a9a48ad7fde427085', '2009-09-04 21:09:32', '8adee63a7c2b2a093ec53145ccdc2f4f07e35fe6', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'stacie.frederick@gmail.com', '2009-09-04 21:09:32', 'f')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 3)
UPDATE "users" SET "tw_userid" = 'tw_shaggyr', "fb_userid" = 'fb_shaggyr', "updated_at" = '2009-08-06 01:43:25' WHERE "id" = 3
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])